{
  "backend/main.mo": "Motoko backend actor implementing a shopping cart system with product management (add products) and cart operations (add to cart, get cart contents, clear cart) using Map and List data structures.",
  "feature_evidence.json": "Feature evidence report documenting two features: adding new images to the application and integrating them into the Smart Shop interface, with associated test IDs and file references.",
  "frontend-file-summaries.txt": "JSON document containing summaries of all frontend files including styling, components, utilities, and pages for the vegetable marketplace application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining a complete design system using OKLCH color space for light and dark modes.",
  "frontend/index.html": "HTML entry point for the Smart Shop application with root div and module script reference.",
  "frontend/src/App.tsx": "Root React component that renders the Home page component.",
  "frontend/src/components/Cart.tsx": "Shopping cart UI component displaying cart items with images, quantities, prices, total calculation, and clear cart functionality in a scrollable sheet.",
  "frontend/src/components/CategoryFilter.tsx": "Category filter component rendering toggle buttons for filtering products by category (All, Vegetables, Leafy Greens).",
  "frontend/src/components/Header.tsx": "Sticky header with shop logo, farm-to-table badge overlay, branding text, and shopping cart button with item count that opens a cart sheet.",
  "frontend/src/components/ProductCard.tsx": "Product card component displaying product image, name, description, price, category badge, and add-to-cart button with hover effects and toast notifications.",
  "frontend/src/components/ProductGrid.tsx": "Responsive grid layout component rendering product cards with an enhanced empty state showing a promo basket image.",
  "frontend/src/components/SearchBar.tsx": "Search input component with search icon for filtering products by name.",
  "frontend/src/hooks/useActor.ts": "React Query hook managing the backend actor instance, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for cart operations including fetching cart contents, adding items, and clearing the cart using the actor from useActor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom market-inspired color palette using OKLCH color space, defining CSS variables for light/dark themes and a market-texture utility class.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/Home.tsx": "Main home page component featuring a hero banner, search/filter functionality, product grid, and organic farm-to-table section with category and search-based product filtering.",
  "frontend/src/utils/mockProducts.ts": "Defines mock product data with 12 vegetable products and utility functions for filtering by ID, category, and search query.",
  "frontend/src/utils/productImages.ts": "Maps product image references to actual marketplace image paths and provides helper functions to retrieve product images or random market images.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom colors using OKLCH, container settings, custom animations, and plugins for typography and container queries.",
  "project_state.json": "Project metadata tracking image requirements for hero banner, organic section, promo basket, and farm-to-table images, with features for adding and integrating these images."
}